In [5]:
import pandas as pd

In [61]:
pd.__version__

'1.0.3'

In [6]:
raw_data1 = {
    'id': [1,2,3,4,5],
    'city': ['Tripoli', 'London', 'Rome', 'Cairo', 'Sydney'], 
    'rank': ['1st', '2nd', '3rd', '4th', '5th'], 
    'population': ['2M', '10M', '1M', '20M', '3M']
}
df1 = pd.DataFrame(raw_data1, columns = ['id', 'city', 'rank', 'population'])
df1

   id     city rank population
0   1  Tripoli  1st         2M
1   2   London  2nd        10M
2   3     Rome  3rd         1M
3   4    Cairo  4th        20M
4   5   Sydney  5th         3M

In [18]:
raw_data2 = {
    'id': [6,7,8,9],
    'City': ['Lisbon', 'Tokyo', 'Mecca', 'Berlin'], 
    'Rank': ['19th', '22nd', '33rd', '40th'], 
    'population': ['1M', '9M', '0.8M', '7M']
}
df2 = pd.DataFrame(raw_data2, columns = ['id', 'City', 'Rank', 'population'])
df2

   id    City  Rank population
0   6  Lisbon  19th         1M
1   7   Tokyo  22nd         9M
2   8   Mecca  33rd       0.8M
3   9  Berlin  40th         7M

In [44]:
raw_data3 = {
    'seq': [1,4,8,9],
    'city': ['Milano', 'Beijing', 'Addis Ababa','Belfast'], 
    'rank': ['7th', '6th', '21st', '11th']
}
df3 = pd.DataFrame(raw_data3, columns = ['seq', 'city', 'rank'])
df3

   seq         city  rank
0    1       Milano   7th
1    4      Beijing   6th
2    8  Addis Ababa  21st
3    9      Belfast  11th

In [22]:
## concat by default stacks tables (on top of each other) in the order you provide
## pass the tables in a list .. pay attention to the index
## to put tables next to each other .. set axis=1
result = pd.concat([df1,df2,df3], ignore_index=True)
result

    id         city  rank population    City  Rank
0    1      Tripoli   1st         2M     NaN   NaN
1    2       London   2nd        10M     NaN   NaN
2    3         Rome   3rd         1M     NaN   NaN
3    4        Cairo   4th        20M     NaN   NaN
4    5       Sydney   5th         3M     NaN   NaN
5    6          NaN   NaN         1M  Lisbon  19th
6    7          NaN   NaN         9M   Tokyo  22nd
7    8          NaN   NaN       0.8M   Mecca  33rd
8    9          NaN   NaN         7M  Berlin  40th
9    1       Milano   7th        NaN     NaN   NaN
10   4      Beijing   6th        NaN     NaN   NaN
11   8  Addis Ababa  21st        NaN     NaN   NaN
12   9      Belfast  11th        NaN     NaN   NaN

In [28]:
## append only stacks tables .. works in two tables at a time
## called from the DF object not from the pandas level
new_df = df1.append(df2)

In [31]:
df2

   id    City  Rank population
0   6  Lisbon  19th         1M
1   7   Tokyo  22nd         9M
2   8   Mecca  33rd       0.8M
3   9  Berlin  40th         7M

In [29]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [id, city, rank, population, City, Rank]
Index: []

In [66]:
## pay attention to the indicator variable .. it gives info on
## which table each row came from .. really useful
pd.merge(df2,df3,how='outer',left_on='id',right_on='seq', 
         suffixes=('_left','_right'), indicator=True)

    id    City  Rank population  seq         city  rank      _merge
0  6.0  Lisbon  19th         1M  NaN          NaN   NaN   left_only
1  7.0   Tokyo  22nd         9M  NaN          NaN   NaN   left_only
2  8.0   Mecca  33rd       0.8M  8.0  Addis Ababa  21st        both
3  9.0  Berlin  40th         7M  9.0      Belfast  11th        both
4  NaN     NaN   NaN        NaN  1.0       Milano   7th  right_only
5  NaN     NaN   NaN        NaN  4.0      Beijing   6th  right_only

In [73]:
## pay attention to the indicator variable .. it gives info on
## which table each row came from .. really useful
pd.merge(df1,df3,how='outer',left_on='id',right_on='seq', 
         suffixes=('_left','_right'), indicator=True).query('_merge =="right_only"')

   id city_left rank_left population  seq   city_right rank_right      _merge
5 NaN       NaN       NaN        NaN  8.0  Addis Ababa       21st  right_only
6 NaN       NaN       NaN        NaN  9.0      Belfast       11th  right_only

In [34]:
df2

   id    City  Rank population
0   6  Lisbon  19th         1M
1   7   Tokyo  22nd         9M
2   8   Mecca  33rd       0.8M
3   9  Berlin  40th         7M

In [35]:
df1

   id     city rank population
0   1  Tripoli  1st         2M
1   2   London  2nd        10M
2   3     Rome  3rd         1M
3   4    Cairo  4th        20M
4   5   Sydney  5th         3M

In [72]:
#df1.join(df2,lsuffix='_L', rsuffix='_R', on='id')

In [70]:
df1

   id     city rank population
0   1  Tripoli  1st         2M
1   2   London  2nd        10M
2   3     Rome  3rd         1M
3   4    Cairo  4th        20M
4   5   Sydney  5th         3M

In [71]:
df2

   id    City  Rank population
0   6  Lisbon  19th         1M
1   7   Tokyo  22nd         9M
2   8   Mecca  33rd       0.8M
3   9  Berlin  40th         7M